[
    {
        "file_name": "jd_1.pdf",
        "job_title": "Axion Ray’S Mission Is To Improve The Quality And Safety Of Engineered Products - Airplanes, Electric Vehicles, And Medical Devices, By Creating The World’S Best Proactive Management Platform, Powered By The Latest Advances In Artificial Intelligence. We'Re Revolutionizing The Way Next-Gen Vehicles Are Made And Are Partnering With Forward-Looking Engineering Leaders To Create And Deploy Ai Models That Will Accelerate Our Speed To An Electric And Supersonic Future. Axion Leverages Bleeding-Edge Tech & Ai Stack - Including Generative Ai And Nlp/Llms - To Solve Real-World Problems. Our Team Includes Experts In Enterprise Ai From Palantir, Mckinsey & Quantumblack, And Other Top Tech Companies. Since Our Founding At The Onset Of 2021, We’Ve Deployed Across Some Of The Largest Automotive And Aerospace Companies In The World. If You Want The Chance To Help Build The Future Of Engineering, Join Us! What You Will Do ●​ Understand Manufacturing Data From Clients, And Devise Strategies To Solve Pain Points And Add Business Value. ●​ Work On Data Exploration, Analysis, And Automation Of Data Cleaning Tasks. ●​ Work With The Data Science And Product Team To Generate Required Insights On The Client’S Data. Who You Are ●​ Bachelor'S Degree In Mechanical/Automotive/Production/Manufacturing Engineering. ●​ Has At Least One Year Of Experience In A Manufacturing Company. ●​ Can Understand, Interpret And Define The Relationship Among Entities In Manufacturing Data, And Technical Statements. ●​ Can Work On Engagements From Understanding The Business Objective Through Data Exploration, Identification, And Validation. ●​ Can Collaborate With Stakeholders Including Machine Learning Engineers, Data Scientists, Data Engineers, And Product Managers ●​ Experience In Working On Excel Sheets Or Other Interfaces For Processing Large Amounts Of Data That Is Available In Documents. ●​ Experience In Python(Pandas)/R Axion Ray Is An Equal Opportunity / Affirmative Action Employer Committed To Diversity In The Workplace. All Qualified Applicants Will Receive Consideration For Employment Without Regard To Race, Color, Religion, Sex, Sexual Orientation, Age, National Origin, Disability, Protected Veteran Status, Gender Identity, Or Any Other Factor Protected By Applicable Federal, State, Or Local Laws.",
        "must_have_skills": [
            "Machine Learning",
            "Python",
            "Excel",
            "Aws",
            "Pandas"
        ],
        "nice_to_have_skills": [],
        "full_text": "axion ray’s mission is to improve the quality and safety of engineered products - airplanes, electric vehicles, and medical devices, by creating the world’s best proactive management platform, powered by the latest advances in artificial intelligence. we're revolutionizing the way next-gen vehicles are made and are partnering with forward-looking engineering leaders to create and deploy ai models that will accelerate our speed to an electric and supersonic future. axion leverages bleeding-edge tech & ai stack - including generative ai and nlp/llms - to solve real-world problems. our team includes experts in enterprise ai from palantir, mckinsey & quantumblack, and other top tech companies. since our founding at the onset of 2021, we’ve deployed across some of the largest automotive and aerospace companies in the world. if you want the chance to help build the future of engineering, join us! what you will do ●​ understand manufacturing data from clients, and devise strategies to solve pain points and add business value. ●​ work on data exploration, analysis, and automation of data cleaning tasks. ●​ work with the data science and product team to generate required insights on the client’s data. who you are ●​ bachelor's degree in mechanical/automotive/production/manufacturing engineering. ●​ has at least one year of experience in a manufacturing company. ●​ can understand, interpret and define the relationship among entities in manufacturing data, and technical statements. ●​ can work on engagements from understanding the business objective through data exploration, identification, and validation. ●​ can collaborate with stakeholders including machine learning engineers, data scientists, data engineers, and product managers ●​ experience in working on excel sheets or other interfaces for processing large amounts of data that is available in documents. ●​ experience in python(pandas)/r axion ray is an equal opportunity / affirmative action employer committed to diversity in the workplace. all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity, or any other factor protected by applicable federal, state, or local laws."
    },
    {
        "file_name": "sample_jd_2.pdf",
        "job_title": "Detailed Job Descriptions For Walk-In Drive 1. Data Science Interns • Internship Duration: 6 Months, Followed By Permanent Employment Based On Performance • Bond: 2.6 Years, Including The Internship Period (Total 30 Months From Joining) • Role Overview: • Work On Data Engineering, Data Visualization, And Data Science Tasks. • Build Deep Learning Models Using Generative Ai, Computer Vision, And Nlp. • Apply Ml And Deep Learning Algorithms Effectively. • Work With Data Visualization Tools Like Tableau Or Power Bi. • Perform Data Processing Using Pandas And Spark. • Possess Strong Analytical And Problem-Solving Skills. • Eligibility Criteria: • Qualification: B.Tech, Be • Batch Eligibility: 2023 And Earlier Pass-Outs • Job Types: Full-Time, Internship, Fresher, Permanent • Stipend: ₹5,000 Per Month • Schedule: Day Shift, Monday To Friday • Location: Pune (Onsite) 2. Data Engineer Intern • Location: Pune (Onsite) • Internship Duration: 6 Months • Bond: 24 Months Post Internship If Converted To Job • Requirements: • Formal Training On Python & Spark • No Prior Experience Required; 2022 Or Earlier Graduates Preferred • Job Responsibilities: • Build Scalable Streaming Data Pipelines • Write Complex Sql Queries To Transform Source Data • Write Stable, Enterprise-Grade Code • Deploy Data Pipelines With Devops Team • Build Automated Job Scheduling And Monitoring Scripts • Skills: • Exceptional Programming Skills In Python, Spark, Kafka, Pyspark, And C++ • Strong Sql And Complex Query Writing Skills • Knowledge Of Pandas, Numpy, And Databricks (Advantageous) • Familiarity With Exploratory Data Analysis And Data Pre-Processing • Eligibility Criteria: • Qualification: B.Tech, Be • Batch Eligibility: 2023 And Earlier Pass-Outs • Job Types: Full-Time, Internship, Fresher, Permanent • Stipend: ₹5,000 Per Month • Schedule: Day Shift, Monday To Friday",
        "must_have_skills": [
            "Sql",
            "Data Analysis",
            "C++",
            "Spark",
            "Python",
            "Numpy",
            "Tableau",
            "Power Bi",
            "Pandas"
        ],
        "nice_to_have_skills": [
            "Sql",
            "Data Analysis",
            "C++",
            "Spark",
            "Python",
            "Numpy",
            "Tableau",
            "Power Bi",
            "Pandas"
        ],
        "full_text": "detailed job descriptions for walk-in drive 1. data science interns • internship duration: 6 months, followed by permanent employment based on performance • bond: 2.6 years, including the internship period (total 30 months from joining) • role overview: • work on data engineering, data visualization, and data science tasks. • build deep learning models using generative ai, computer vision, and nlp. • apply ml and deep learning algorithms effectively. • work with data visualization tools like tableau or power bi. • perform data processing using pandas and spark. • possess strong analytical and problem-solving skills. • eligibility criteria: • qualification: b.tech, be • batch eligibility: 2023 and earlier pass-outs • job types: full-time, internship, fresher, permanent • stipend: ₹5,000 per month • schedule: day shift, monday to friday • location: pune (onsite) 2. data engineer intern • location: pune (onsite) • internship duration: 6 months • bond: 24 months post internship if converted to job • requirements: • formal training on python & spark • no prior experience required; 2022 or earlier graduates preferred • job responsibilities: • build scalable streaming data pipelines • write complex sql queries to transform source data • write stable, enterprise-grade code • deploy data pipelines with devops team • build automated job scheduling and monitoring scripts • skills: • exceptional programming skills in python, spark, kafka, pyspark, and c++ • strong sql and complex query writing skills • knowledge of pandas, numpy, and databricks (advantageous) • familiarity with exploratory data analysis and data pre-processing • eligibility criteria: • qualification: b.tech, be • batch eligibility: 2023 and earlier pass-outs • job types: full-time, internship, fresher, permanent • stipend: ₹5,000 per month • schedule: day shift, monday to friday"
    }
]