[
    {
        "file_name": "jd_1.pdf",
        "full_text": "Axion Ray’s mission is to improve the quality and safety of engineered products - airplanes, electric vehicles, and medical devices, by creating the world’s best proactive management platform, powered by the latest advances in artificial intelligence. We're revolutionizing the way next-gen vehicles are made and are partnering with forward-looking engineering leaders to create and deploy AI models that will accelerate our speed to an electric and supersonic future. Axion leverages bleeding-edge tech & AI stack - including Generative AI and NLP/LLMs - to solve real-world problems. Our team includes experts in Enterprise AI from Palantir, McKinsey & QuantumBlack, and other top tech companies. Since our founding at the onset of 2021, we’ve deployed across some of the largest Automotive and Aerospace companies in the world. If you want the chance to help build the future of engineering, join us! What you will do ●​ Understand manufacturing data from clients, and devise strategies to solve pain points and add business value. ●​ Work on data exploration, analysis, and automation of data cleaning tasks. ●​ Work with the data science and product team to generate required insights on the client’s data. Who you are ●​ Bachelor's degree in Mechanical/Automotive/Production/Manufacturing engineering. ●​ Has at least one year of experience in a manufacturing company. ●​ Can understand, interpret and define the relationship among entities in Manufacturing data, and technical statements. ●​ Can work on engagements from understanding the business objective through data exploration, identification, and validation. ●​ Can collaborate with stakeholders including machine learning engineers, data scientists, data engineers, and product managers ●​ Experience in working on Excel sheets or other interfaces for processing large amounts of data that is available in documents. ●​ Experience in Python(Pandas)/R Axion Ray is an Equal Opportunity / Affirmative Action employer committed to diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity, or any other factor protected by applicable federal, state, or local laws.",
        "sections": {}
    },
    {
        "file_name": "resume - 1.pdf",
        "full_text": "Pavan Kalyan pavankalyan462@gmail.com |9876543210 | LinkedIn | GitHub Objective Enthusiastic and detail-oriented Data Analyst with hands-on experience in Python, SQL, and data visualization. Skilled in conducting in-depth data analysis, web scraping, and building interactive dashboards. Proven ability to generate actionable insights and communicate findings clearly. Eager to contribute to a data-driven organization with strong analytical and collaboration skills. Skills Languages & Tools Data Visualization Python, SQL Matplotlib, Seaborn, Power BI Libraries & Frameworks Soft Skills Pandas, NumPy, Scikit-learn, BeautifulSoup Analytical Thinking | Attention to Detail | Team Collaboration Problem Solving Education Bachelor of Science in Physics 2020-Nov Bharti Vidyapeeth Pune Projects Data Analysis on Used Car Listings • Scraped car data from cars24.com including make, model, mileage, and price. • Performed data cleaning and exploratory data analysis (EDA) using Pandas and NumPy. • Built visualizations in Seaborn and Matplotlib to identify factors influencing car prices. • Derived insights to understand pricing trends by brand, mileage, and age. Analysis of Pizza Hut’s Sales Data using SQL • Analyzed sales data using SQL to uncover trends in customer preferences and sales performance. • Wrote complex queries to extract revenue, top-selling items, and location-based sales data. • Created reports that provided insights into regional performance and product popularity. Organizational Hierarchy Management Using SQL • I designed a relational database to model a company's organizational hierarchy, from founders to employees. • Using structured tables and foreign key relationships, I ensured referential integrity across roles like lead managers, senior managers, and employees. • I wrote complex SQL queries to join multiple tables and derive insights such as role counts per company. • The dataset uses sample data for demonstration purposes, emphasizing schema design and query logic. Certifications Advanced Data Science with Python – FutureSkills Prime | NASSCOM | April 2025",
        "sections": {}
    },
    {
        "file_name": "Resume - 10.pdf",
        "full_text": "Afroz Khan HYDERABAD | afrozkhan7020@gmail.com |https://github.com/afrozkhan| https://www.linkedin.com/in/afrozkhan35b0822 CAREER OBJECTIVE To secure a challenging role that leverages analytical skills, statistical knowledge, and programming expertise to drive data-driven decisions, optimize strategies, and deliver actionable insights through reports and visualizations. EDUCATIONAL QUALIFICATIONS AURORA DEGREE AND PG COLLEGE -(2020-2022) Master of science (statistics) CGPA:6.39 ST.ANN'S DEGREE AND PG COLLEGE FOR WOMEN,MALLAPUR-(2017-2020) Bachelor of science (mathematics/statistics/computer science) CGPA:8.6 PROJECTS Zomato Delivery Analysis Using Tableau : Analyzed the dataset using tableau to answer business questions posed by Chief strategy officer(CSO) such as the total number of cuisines in restaurants where zomato delivers food, top 5 restaurants based on price range,rating and number of cuisines each country has. Music Store Analysis Using My Sql Project : To analyze a music store database using my sql and find ways to optimize the store's operations.It involves querying multiple tables, joining from multiple tables and extracting key insights from the database. Exploratory Data Analysis Using Beautiful Soup: The purpose of the web scraping project on ambition box is to extract data from the website,Using beautiful soup, create dataset and make visualization. The data can be used to analyze companies according to ratings, salaries, locations, employee count of the company. CERTIFICATIONS: ● EXPLORATORY DATA ANALYSIS CERTIFICATE FROM INNOMATICS RESEARCH LAB ● DATA ANALYSIS CERTIFICATE FROM INNOMATICS RESEARCH LAB ● Completed the Mahindra pride classroom employability skills training and received a certificate of achievement for developing strong communication, teamwork and time management. -(09/2019) TECHNICAL SKILLS ● Programming language: Python ● SQL ● Statistics ● Excel ● Tableau ● Power bi Achievements ● Secured 1st prize in start up club competition in college fest at St.ann’s degree and pg college. ● Secured 1st prize in quiz competition in science fair at kakatiya techno school. SOFT SKILLS ● Strong analytical skills ● Adaptable ● Decision making ● Creativity PERSONAL DETAILS Date of Birth: 05-12-1996 Gender : Female Languages known: English,Telugu, Hindi",
        "sections": {
            "certifications": "● EXPLORATORY DATA ANALYSIS CERTIFICATE FROM INNOMATICS RESEARCH LAB ● DATA ANALYSIS CERTIFICATE FROM INNOMATICS RESEARCH LAB ● Completed the Mahindra pride classroom employability skills training and received a certificate of achievement for developing strong communication, teamwork and time management. -(09/2019) TECHNICAL SKILLS ● Programming language: Python ● SQL ● Statistics ● Excel ● Tableau ● Power bi Achievements ● Secured 1st prize in start up club competition in college fest at St.ann’s degree and pg college. ● Secured 1st prize in quiz competition in science fair at kakatiya techno school. SOFT SKILLS ● Strong analytical skills ● Adaptable ● Decision making ● Creativity PERSONAL DETAILS Date of Birth: 05-12-1996 Gender : Female Languages known: English,Telugu, Hindi"
        }
    },
    {
        "file_name": "RESUME - 2.pdf",
        "full_text": "JAY RAJ Email: jayraj10@gmail.com | Phone No: +91 9876543210 | Linkdin | Github SUMMARY AspiringDataAnalyst with hands-on experience in turning raw data into meaningful insights that help improve business performance. Undergoing training at Innomatics Research Labs, focused on data analysis using SQL, Python, and libraries such as Pandas, NumPy, Matplotlib, and Seaborn. Strong foundation in Statistics and Mathematics with proficiency in analytical tools and technologies to derive actionable insights. EDUCATION Bachelor of Technology in Computer Science and Engineering CGPA -7.5 DEC 2021 -2025 Karmveer Bhaurao Patil College of Engineering Satara SKILLS Programming Languages: Python (Pandas, NumPy, Matplotlib, Seaborn), SQL (MySQL, PostgreSQL) Data Manipulation & Cleaning: Handling missing values, data transformation, filtering, grouping, exploratory data analysis (EDA), and web scraping using Beautiful Soup and Requests Data Visualization: Power BI (Dashboards, Interactive Charts), Microsoft Excel (Pivot Tables, Conditional Format , Chart Tools) Statistical Analysis: Descriptive statistics, correlation analysis, hypothesis testing Soft Skills: Problem Solving, Critical Thinking, Collaboration, Communication, Adaptability PROJECTS Data-Driven Analysis of MHT-CET 2024 Engineering College Cutoffs Tools & Technologies: Python (Pandas, NumPy, Matplotlib, Seaborn, Regex), SQL, Power BI • Extracted real-time cutoff data from https://fe2024.mahacet.org/ using Python web scraping (Requests,Beautiful Soup). • Used Regex to transform unstructured cutoff strings into structured columns (College Name, Branch, Category, Cutoff Score). • Cleaned and transformed data by handling missing values, standardizing formats, and performing type conversions. Conducted Exploratory Data Analysis (EDA) to identify top-performing colleges, high-demand branches, and category-wise trends. • Detected and addressed outliers, applied data visualization techniques (histograms, boxplots, heatmaps) using Matplotlib & Seaborn. • Built an interactive Power BI dashboard to explore college-wise, region-wise, and category-wise cutoff comparisons. Weather Data Analysis Dashboard – Power BI Project • Designed and developed a 5-page interactive Power BI dashboard analyzing weather parameters (rainfall, temperature, humidity, wind speed) across Telangana districts and mandals, with centralized navigation and intuitive slicers. • Applied Power Query for data cleaning and transformation, used DAX to compute weather KPIs, detect seasonal trends, and highlight anomalies across regions. • Created dynamic visualizations including bar, line, scatter, donut, heat maps, and tables to uncover actionable insights from four-year weather data. • Enabled climate-aware decision-making by identifying vulnerable regions and long-term weather shifts, supporting planning in agriculture, health, and infrastructure. Music Store Sales & Customer Insights Analysis Tools & Technologies: MySQL (Joins, Subqueries, CTEs, Window Functions) • Analyzed a normalized 11-table relational database consisting of (employee, customer, invoice, invoice_line, track, playlist, playlist_track, album, artist, genre, and media_type) • Wrote optimized SQL queries using joins ,group by ,havings , and window functions to identify sales and customer trends. • Gained expertise in relational design, foreign key relationships, and multi-table querying. • Delivered clean, well-structured queries to support data-driven decision-making. • Practiced query modularity and performance tuning for efficient analysis.",
        "sections": {
            "skills": "Problem Solving, Critical Thinking, Collaboration, Communication, Adaptability PROJECTS Data-Driven Analysis of MHT-CET 2024 Engineering College Cutoffs Tools & Technologies: Python (Pandas, NumPy, Matplotlib, Seaborn, Regex), SQL, Power BI • Extracted real-time cutoff data from https://fe2024.mahacet.org/ using Python web scraping (Requests,Beautiful Soup). • Used Regex to transform unstructured cutoff strings into structured columns (College Name, Branch, Category, Cutoff Score). • Cleaned and transformed data by handling missing values, standardizing formats, and performing type conversions. Conducted Exploratory Data Analysis (EDA) to identify top-performing colleges, high-demand branches, and category-wise trends. • Detected and addressed outliers, applied data visualization techniques (histograms, boxplots, heatmaps) using Matplotlib & Seaborn. • Built an interactive Power BI dashboard to explore college-wise, region-wise, and category-wise cutoff comparisons. Weather Data Analysis Dashboard – Power BI Project • Designed and developed a 5-page interactive Power BI dashboard analyzing weather parameters (rainfall, temperature, humidity, wind speed) across Telangana districts and mandals, with centralized navigation and intuitive slicers. • Applied Power Query for data cleaning and transformation, used DAX to compute weather KPIs, detect seasonal trends, and highlight anomalies across regions. • Created dynamic visualizations including bar, line, scatter, donut, heat maps, and tables to uncover actionable insights from four-year weather data. • Enabled climate-aware decision-making by identifying vulnerable regions and long-term weather shifts, supporting planning in agriculture, health, and infrastructure. Music Store Sales & Customer Insights Analysis Tools & Technologies: MySQL (Joins, Subqueries, CTEs, Window Functions) • Analyzed a normalized 11-table relational database consisting of (employee, customer, invoice, invoice_line, track, playlist, playlist_track, album, artist, genre, and media_type) • Wrote optimized SQL queries using joins ,group by ,havings , and window functions to identify sales and customer trends. • Gained expertise in relational design, foreign key relationships, and multi-table querying. • Delivered clean, well-structured queries to support data-driven decision-making. • Practiced query modularity and performance tuning for efficient analysis."
        }
    },
    {
        "file_name": "resume - 3.pdf",
        "full_text": "Chandra shekar Chandrashekar@gmail.com | linkedin.com/in/chandra-https://github.com/chandra006 | 9876543210 Professional Summary A Data Analytics enthusiast with a background in Automation and Robotics, skilled in Python, SQL, Power BI, and Excel. worked on projects like real estate analysis and Dashboards in Power-BI combining data insights with problem-solving. With strong analytical and technical skills, aim to drive smart, data-based decisions in innovative environments. Education Bachelor of Engineering (B.E.) Automation & Robotics Engineering (Dec 21-May25) Savitribai Phule Pune University. [ 9.3 CGPA ] Innomatics Research Lab (Data Analyst) (Nov 24-present) Technical Skills Data Analysis & Data Visualization: SQL (My SQL, PostgreSQL) Power BI, Matplotlib, Seaborn, Pandas, NumPy ∙ Programming & Data Processing: Python (Pandas, NumPy), Power Query, DAX Excel (Pivot Table, Data Validation), PowerPoint, Word Project Pune Rental Insights - Magicbricks (Python) (March 25) ∙ Analyzed rental property data to identify pricing trends by location and property type. ∙ Performed EDA and visualized key insights using Python, Pandas, Matplotlib and Seaborn. ∙ Highlighted market patterns and outliers to support smarter rental decisions and proper Insights Sales Dashboard– Adidas Data (Power BI) (April 25) ∙ Created an interactive dashboard to analyze sales by region, product, and time. ∙ Used DAX to calculate KPIs like revenue, profit, and quantity sold. ∙ Enabled data-driven insights through filters, slicers, and clean visualizations. Library Database Analysis (MySQL ) (March 25) ∙ Designed and managed a relational database for a library system using MySQL. ∙ Executed complex queries to analyze book circulation, user activity, and popular genres. ∙ Applied joins, aggregate functions, and subqueries to extract meaningful insights. Expererience Data Science & Machine Learning Intern (Dec 23 - Jan 24) Maxgen Technologies Pvt. Ltd., Kharadi, Pune ∙ Built a Brain Stroke Prediction model using machine learning techniques like Logistic Regression and Decision Tree. ∙ Performed data cleaning, feature selection, and EDA to prepare and understand real-world health data. ∙ Visualized key insights using Python libraries such as Matplotlib and Seaborn in Jupyter Notebook. Certification Python programming, Data analytics",
        "sections": {}
    },
    {
        "file_name": "Resume - 4.pdf",
        "full_text": "S Supriya ​ supriya023@gmail.com, +91987674532 Objective Aspiring Data Analyst with strong foundations in Python, SQL, Power BI, and data visualization. Experienced in handling real-world projects involving web scraping, EDA, and dashboard development. Eager to contribute to data-driven decision-making by transforming complex datasets into actionable insights. Education B.Tech in Computer Science And Engineering CGPA: 6.79 2021 – 2025 Karmaveer Bhaurao Patil College of Engineering,Satara Data Science Internship Innomatics Research Lab SKILLS Programming: Python , SQL, C++ Data Skills: EDA(Pandas, NumPy, Matplotlib, Seaborn), Data Cleaning, Visualization, Statistics Data Tools: Power BI, Excel ,WebScrapin Soft Skills: Problem-Solving, Data Interpretation, Team Collaboration Project Cricket Stats Analysis Project Tools: Python (BeautifulSoup, Pandas), Power BI, EDA, Web Scraping Scraped and structured Test cricket batting data from ESPNcricinfo using Python and BeautifulSoup for analysis. Performed EDA using Pandas to uncover top-performing players, consistency trends, and format-specific insights. Created a Power BI dashboard visualizing player rankings, yearly run aggregates, and country-wise performance patterns. Grocery Store Management System Tools: SQL, Python (Pandas, Matplotlib) Designed a relational database with 7 interlinked tables for managing grocery operations. Used SQL for data modeling and business queries on customers, products, and sales. Performed EDA using Python to analyze sales trends, customer behavior, and product performance. Visualized insights with Matplotlib and summarized findings in a presentation. Weather Data Analysis – Telangana Tools: Python, SQL, Power BI Analyzed rainfall, temperature, humidity, and wind speed data across Telangana’s districts. Performed EDA to find trends, anomalies, and seasonal patterns. Built interactive Power BI dashboards to visualize weather metrics. Explored correlations between climate parameters and regional variations. Certificates Data Science Master Vertual Internship - Eduskill Python - Innomatics Research Lab",
        "sections": {
            "skills": "EDA(Pandas, NumPy, Matplotlib, Seaborn), Data Cleaning, Visualization, Statistics Data Tools: Power BI, Excel ,WebScrapin Soft Skills: Problem-Solving, Data Interpretation, Team Collaboration Project Cricket Stats Analysis Project Tools: Python (BeautifulSoup, Pandas), Power BI, EDA, Web Scraping Scraped and structured Test cricket batting data from ESPNcricinfo using Python and BeautifulSoup for analysis. Performed EDA using Pandas to uncover top-performing players, consistency trends, and format-specific insights. Created a Power BI dashboard visualizing player rankings, yearly run aggregates, and country-wise performance patterns. Grocery Store Management System Tools: SQL, Python (Pandas, Matplotlib) Designed a relational database with 7 interlinked tables for managing grocery operations. Used SQL for data modeling and business queries on customers, products, and sales. Performed EDA using Python to analyze sales trends, customer behavior, and product performance. Visualized insights with Matplotlib and summarized findings in a presentation. Weather Data Analysis – Telangana Tools: Python, SQL, Power BI Analyzed rainfall, temperature, humidity, and wind speed data across Telangana’s districts. Performed EDA to find trends, anomalies, and seasonal patterns. Built interactive Power BI dashboards to visualize weather metrics. Explored correlations between climate parameters and regional variations. Certificates Data Science Master Vertual Internship - Eduskill Python - Innomatics Research Lab"
        }
    },
    {
        "file_name": "Resume - 5.pdf",
        "full_text": "Suresh Shiv shivsuresh1520@gmail.com | 9876543210 | LinkedIn |GitHub SUMMARY Results-driven Business Analyst with expertise in SQL, Power BI (DAX), Python and business research tools, Skilled in transforming raw data into actionable insights to drive business decisions. Proficient in web analytics, competitor analysis, data visualization, Strong analytical and problem-solving skills with expertise in sales research, customer segmentation and business intelligence. SKILLS: Languages: Python, SQL, VBA Libraries & Frameworks: Pandas, NumPy, Matplotlib, Seaborn Tools: Power BI, Excel (Advanced formulas, pivot Tables, Power Query), Jupyter Notebook, Google Collab, Git Cloud Computing: Basic knowledge of IaaS, PaaS, Storage, and Networking (Azure, AWS) Soft Skills: Communication, Analytical skill, Leadership, Problem solving, Adaptability Business Intelligence & Web Analytics: Google Ads, SEO, Competitor Analysis Education: Punyashlok Ahilyadevi Holkar Solapur University, Solapur May - 2015 B.E in Electronics and Telecommunication Percentage – 71.67% PROJECTS: Expense Tracker & Automation Tools - Excel VB • Built user form- based Expense Tracker to categorize, sum, and visualize user-entered expenditures • Developed macros to auto-fill sequences, remove blank rows, and save workbooks with dynamically generated timestamps • Practiced VBA fundamentals: loops, conditional statements, MsgBox simple UI integration • Demonstrated file automation, data cleanup, and user interaction—all within a concise Excel VBA-enabled project Vrinda Store Data Analysis | Excel| Link April-2023 • Analysed the 2024 annual sales report Store Vrinda Share to identify trends, understand customer behaviour and generate actionable insights for increasing sales in the upcoming year. • Cleaned and pre-processed raw data to ensure accuracy and consistency using Excel. • Performed data analysis to uncover key performance indicators, sales patterns, and customer demographics • Designed and developed an interactive dashboard to visualize data trends, enabling store manager to make informed business decision and get 12% of profit. Movie sales Analysis |Power BI| Link • Built an interactive Power BI Movie Sales dashboard to visualize budget, gross revenue, IMDb score, genre, and director trends. • Used complex parameters to drill down in worksheets and customize using filters and slicers. • Used different types of customized visualizations such as bar charts, pie charts, Donat charts, clustered bar charts, slicers, etc. • Using DAX found Action, Adventure, comedy and drama drive over 80% of total box office revenues. Analysis on E-commerce product (TVs) Link EDA| SQL | Power BI • Extracted and analysed 528 product data having 11 features from website using Beautiful Soup. • Performed data cleaning by handling 11% missing values and ensuring data consistency for accurate insights. • Market trend analysis-Understanding popular TV models having 4.1 rating and price trend. • Price comparison with different brands, Track price changes over the year between 2023 to 2025. Digital Music Store Analysis • Analysed customer purchasing patterns Developed and executed SQL queries to analyse the Digital Music Store dataset addressing key business questions and providing actionable insights to the stakeholders. • and uncovered that around 60% of customers preferred playlists with diverse genres, leading to as customised product offering strategy. • Supported business growth by uncovering insights that informed marketing strategies and sales optimizations. Energy Consumption Analysis Link • Designed a relational database to analyse energy, emission, GDP and population data. • Wrote complex SQL queries to extract insights on energy efficiency and economic impact. • Analysed trends across 6 interlinked tables and presented sustainability-focused insights. Publications Getting Started with Data Analysis: A Beginner's Guide” – Medium Published a beginner-friendly blog introducing core data analysis concepts using Python and Excel. Explained data cleaning, exploratory data analysis (EDA), and visualization techniques with hands-on examples. Well-received for its clarity and practical approach by students and aspiring analysts. “Uncovering Insights with SQL: Practical Queries for Data Analysts” – Medium Authored a blog demystifying essential SQL concepts including joins, aggregations, subqueries, and window functions. Used real-world scenarios to demonstrate data extraction and insight generation techniques. Appreciated by entry-level professionals for its applied, easy-to-understand SQL use cases. Certifications: Gold in python programming (ID: M_101929) – Innomatics Research labs Gold in Exploratory data Analysis (ID: M_102115) – Innomatics Research labs Gold in Data Analysis with MySQL (ID: M_102071) & Gold in Power BI (ID:M_102167) - Innomatics Research labs Deloitte Data Analytics job simulation certificate by Forage",
        "sections": {
            "education": "Punyashlok Ahilyadevi Holkar Solapur University, Solapur May - 2015 B.E in Electronics and Telecommunication Percentage – 71.67%",
            "skills": "Languages: Python, SQL, VBA Libraries & Frameworks: Pandas, NumPy, Matplotlib, Seaborn Tools: Power BI, Excel (Advanced formulas, pivot Tables, Power Query), Jupyter Notebook, Google Collab, Git Cloud Computing: Basic knowledge of IaaS, PaaS, Storage, and Networking (Azure, AWS) Soft Skills: Communication, Analytical skill, Leadership, Problem solving, Adaptability Business Intelligence & Web Analytics: Google Ads, SEO, Competitor Analysis",
            "projects": "Expense Tracker & Automation Tools - Excel VB • Built user form- based Expense Tracker to categorize, sum, and visualize user-entered expenditures • Developed macros to auto-fill sequences, remove blank rows, and save workbooks with dynamically generated timestamps • Practiced VBA fundamentals: loops, conditional statements, MsgBox simple UI integration • Demonstrated file automation, data cleanup, and user interaction—all within a concise Excel VBA-enabled project Vrinda Store Data Analysis | Excel| Link April-2023 • Analysed the 2024 annual sales report Store Vrinda Share to identify trends, understand customer behaviour and generate actionable insights for increasing sales in the upcoming year. • Cleaned and pre-processed raw data to ensure accuracy and consistency using Excel. • Performed data analysis to uncover key performance indicators, sales patterns, and customer demographics • Designed and developed an interactive dashboard to visualize data trends, enabling store manager to make informed business decision and get 12% of profit. Movie sales Analysis |Power BI| Link • Built an interactive Power BI Movie Sales dashboard to visualize budget, gross revenue, IMDb score, genre, and director trends. • Used complex parameters to drill down in worksheets and customize using filters and slicers. • Used different types of customized visualizations such as bar charts, pie charts, Donat charts, clustered bar charts, slicers, etc. • Using DAX found Action, Adventure, comedy and drama drive over 80% of total box office revenues. Analysis on E-commerce product (TVs) Link EDA| SQL | Power BI • Extracted and analysed 528 product data having 11 features from website using Beautiful Soup. • Performed data cleaning by handling 11% missing values and ensuring data consistency for accurate insights. • Market trend analysis-Understanding popular TV models having 4.1 rating and price trend. • Price comparison with different brands, Track price changes over the year between 2023 to 2025. Digital Music Store Analysis • Analysed customer purchasing patterns Developed and executed SQL queries to analyse the Digital Music Store dataset addressing key business questions and providing actionable insights to the stakeholders. • and uncovered that around 60% of customers preferred playlists with diverse genres, leading to as customised product offering strategy. • Supported business growth by uncovering insights that informed marketing strategies and sales optimizations. Energy Consumption Analysis Link • Designed a relational database to analyse energy, emission, GDP and population data. • Wrote complex SQL queries to extract insights on energy efficiency and economic impact. • Analysed trends across 6 interlinked tables and presented sustainability-focused insights. Publications Getting Started with Data Analysis: A Beginner's Guide” – Medium Published a beginner-friendly blog introducing core data analysis concepts using Python and Excel. Explained data cleaning, exploratory data analysis (EDA), and visualization techniques with hands-on examples. Well-received for its clarity and practical approach by students and aspiring analysts. “Uncovering Insights with SQL: Practical Queries for Data Analysts” – Medium Authored a blog demystifying essential SQL concepts including joins, aggregations, subqueries, and window functions. Used real-world scenarios to demonstrate data extraction and insight generation techniques. Appreciated by entry-level professionals for its applied, easy-to-understand SQL use cases.",
            "certifications": "Gold in python programming (ID: M_101929) – Innomatics Research labs Gold in Exploratory data Analysis (ID: M_102115) – Innomatics Research labs Gold in Data Analysis with MySQL (ID: M_102071) & Gold in Power BI (ID:M_102167) - Innomatics Research labs Deloitte Data Analytics job simulation certificate by Forage"
        }
    },
    {
        "file_name": "Resume - 6.pdf",
        "full_text": "Sujeeth Kumar Hyderabad, Telangana•sujithkumar2021@gmail.com • +91-9876543210 • linkedin.com/sujeeth--123a214 PROFESSIONAL SUMMARY AI and Data Science enthusiast with expertise in Python, SQL, and data visualization. Experienced in data analytics and AI driven solutions through hands-on internships. Skilled in building predictive models, optimizing workflows, and extracting insights from complex datasets. Passionate about leveraging machine learning and data-driven approaches to solve real-world challenges. EDUCATION Bachelor of Engineering (Artificial Intelligence & Machine Learning) July 2022 -June 2025 Sahyadri Valley College of Engineering and Technology, Pune CGPA 8.20/10 Diploma- (Information & Technology) July 2019 – May 2022 Government Polytechnic Awasari, Pune Percentage – 79.38% Class 10th- SSC June 2018 – May 2019 Shambhuling Shivacharya Vidyalaya, Latur Percentage – 83.80% SKILLS • Programming Languages: Python, SQL, Statistics. • Frameworks : Pandas, NumPy, Scikit-learn, Matplotlib, Seaborn. • Analytical Tools : Power BI, Excel, Tableau, MySQL, SQLite. • Data Analytics Skills : Data Cleaning, Exploratory Data Analysis (EDA), Data Visualization. • Platforms : Jupyter Notebook, Visual Studio Code. ACADEMIC PROJECTS SQL-Based Grocery Store Management System| LINK June 2025 - July 2025 • Created a database to manage grocery store data like products, customers, suppliers, and orders. • Wrote SQL queries to find useful information such as top-selling items and low stock products. • Analyzed sales and customer activity to help improve store performance. • Used joins and filters in SQL to connect different tables and get detailed reports. • Helped store managers make better decisions using the data. Used Bike Market Analysis – CredR.com | LINK February 2025 - April 2025 • Scraped used bike data from CredR.com using Python (BeautifulSoup), extracting key features like Brand, Model, Year, Km, Cc, Owner, Location, Price, And Original Price.. • Cleaned and structured the dataset using Pandas, handling missing values and converting data into analyzable formats. • Conducted exploratory data analysis (EDA) to study price trends based on brand, mileage, bike age, and location. • Visualized insights using Matplotlib and Seaborn,showing brand-wise average prices and most affordable models. • Delivered actionable insightsin a summary report with graphs and interactive visuals. Deepfake Detection Using Machine Learning | LINK June 2024 - May 2025 • Developed a deepfake video detection system using LSTM (Long Short-Term Memory) neural networks. • Collected and used different types of fake videos like face swap, lip sync, and voice change for training. • Built the project using Python, with a Flask-based web interface for uploading and checking videos. • Measured accuracy of the model using metricslike accuracy, precision, recall, and F1-score. • Used LSTM to understand video frame sequences and detect changes that indicate fake content. CERTIFICATIONS • Career Essentials in Data Analysis ( Microsoft & LinkedIn ) | CERTIFICATE July 2024 • . Data Analytics Essentials (CISCO) | CERTIFICATE May 2024 • Python for Data Science ( IBM ) | CERTIFICATE February 2024",
        "sections": {}
    },
    {
        "file_name": "Resume - 7.pdf",
        "full_text": "Tarun Kumar Data Analyst | Power BI Analyst | Business Analyst Tarunkumar@gmail.com| https://www.linkedin.com/intarun |9876543210 Summary Result-driven Data Analyst with expertise in SQL,Power BI, and Python.Skilled in transforming raw data into actionable insights to drive business decisions.Experienced in data visualization,business intelligence and database management with hands-on experience in MySQL, Power Query, and DAX Strong analytical and problem-solving skills with a keen interest in leveraging data to optimize business performance. Education Dr. Babasaheb Ambedkar Technological University Bachelor of Technology(CSE) Dec.2021–June 2025 Technical Skills Languages:Python,SQL(MySQL,Postgres). Data Visualization:Matplotlib,Seaborn,PowerBI(Dashboards, DAX,DataModelling),Excel. Developer Tools:Git,VsCode,GoogleCollab,PowerQuery. Data Analysis:Pandas,NumPy. Project Web Scraping,Python April.2025 Analyzing prices of sold cars – Cars24 ∙ Developed a web scraping tool to extract detailed listings of used cars from Cars24, including data such as car model, price, year, mileage, fuel type, and location. ∙ Cleaned and structured the scraped data using Pandas for further analysis. ∙ Conducted exploratory data analysis (EDA) to identify pricing trends, popular car brands, and regional availability. ∙ Presented insights using data visualization tools (e.g., Matplotlib/Seaborn) to support data-driven decision-making. MySQL May.2025–Present Library Management System ∙ Designed and implemented a normalized database schema for efficient book and member management. ∙ Developed stored procedures and triggers to automate over due fine calculations. ∙ Wrote optimized SQL queries for book tracking,issuing,and over due reports. ∙ Designed a reporting system for librarians to track book availability and member activity. Power BI May.2025–Present Sales Performance Dashboard ∙ Developed an interactive Power BI dashboard to visualize and analyze sales data across regions, products, and time periods. ∙ Key features included dynamic charts for monthly sales trends, top-performing products, regional sales comparison, and KPI cards to track revenue goals. ∙ Improved data-driven decision-making by providing clear insights into sales performance and growth opportunities. Certifications Achieved a golden rank in python module at Innomatics Research labs. May-2025 ∙ Gained expertise in data analysis,SQL,Excel,and visualization tools such as PowerBI. ∙ Learned data cleaning,transformation,and statistical analysis techniques.",
        "sections": {}
    },
    {
        "file_name": "Resume - 8.pdf",
        "full_text": "Vamshi Kiran vamsikiran@gmail.com | linkedin.com/in/vamsi-kiran| github.com/vamshi | 9876543210 Summary Results-driven Data Analyst with expertise in SQL, Power BI (DAX), Python and business research tools .Skilled in transforming raw data into actionable insights to drive business decisions. Proficient in Data visualization, competitor analysis, web analysis, Strong analytical and problem-solving skills with experience in sales research, customer segmentation and business intelligence to optimize business perfomance Education Master in Business Administration – Marketing & International Business All India Shree Shiva Memorial Society, IOM, Hyderabad (2022 – 2024) Bachelor of Business Administration – Marketing Vasantdada patil institute of management & Research, Sangli (2019 - 2022) Technical Skills Market Research Tools: Apollo, Google Analytics Data Analysis & Data Visualization: SQL (My SQL, PostgreSQL) Power BI, Matplotlib, Seaborn, Pandas, NumPy Programming & Data Processing: Python (Pandas, NumPy), Power Query, DAX Excel (Pivot Table, Data Validation), PowerPoint, Word Business Intelligence & Web Analytics: Google Ads, SEO, Competitor Analysis Projects Consumer sentiment Analysis - Top MBA Colleges in India ∙ Analyzing top MBA colleges in India based on their College Ranking, Fees, Exam, Student review & Ranking. ∙ For data cleaning and statistical comparisons used Pandas and Numpy. ∙ Created interactive Charts and insights dashboard using Matplotlib, Seaborn, and Pandas Data Frame styling for better insights. ∙ Compared government and private institutions based on fees, ranking, and admission criteria & correlation between ratings, Rankings and fees Data analysis & visualization – Telangana weather Data ∙ Analysed Telangana's weather data, covering rainfall (mm), temperature (°C), humidity (%), and wind speed across different mandals. ∙ Developed interactive Power BI dashboards to assess weather impact on regional climate trends, seasonal variations. ∙ Applied DAX measures to analyze monthly trends, anomalies, and forecasting insights for better decision-making ∙ Conducted comparative analysis across multiple mandals to identify high-risk areas for extreme weather events Management System (MySQL & Data Warehousing) ∙ Designed & implemented a normalized database schema to streamline book inventory and member management processes. ∙ Developed stored procedure and triggers to automate fine calculation and ensure data integrity for overdue tracking. ∙ Created optimized SQL queries and a reporting system for efficient book tracking, availability monitoring & member engagement analysis",
        "sections": {}
    },
    {
        "file_name": "Resume - 9.pdf",
        "full_text": "Rachana M Contact Phone +919876543210 E-mail rachana202@gmail.com LinkedIn https://www.linkedin.com/in /rachanam249/ Core Skills ●​ Programming: Python, SQL, Python Full Stack ●​ Data Analysis: Exploratory Data Analysis (EDA), Pandas, NumPy ●​ Data Visualization: Matplotlib, Seaborn, pyplot ●​ Business Intelligence (BI) Tool: Tableau ●​ Descriptive and Inferential Statistics ●​ Machine Learning ●​ Database Management ●​ Web Scraping ●​ Python Django ●​ MySQL Database ●​ Data Cleaning ●​ Problem Solving ●​ Communication Skills Education Master of Computer Application (MCA)​ Results-driven and highly motivated MCA graduate with a strong foundation in computer science and a passion for data analysis, machine learning, and software development. Proficient in Python, SQL, and data visualization tools, with hands-on experience in database management, web scraping, and machine learning model development. Adept at leveraging technology to solve complex problems and extract actionable insights. Excellent interpersonal and communication skills, with a commitment to delivering high-quality results. Projects Data Analysis | Prominent Series Website​ Hyderabad, Telangana | Jan 2024 – May 2025 ●​ Conducted Web Scraping to gather data from the website for analysis. ●​ Performed Exploratory Data Analysis (EDA) to extract valuable insights from the collected data. ●​ Cleaned and pre-processed data, ensuring data quality and integrity. ●​ Created informative visualizations using Matplotlib and Seaborn. ●​ Addressed specific problem statements to enhance user experience on the website. SQL Analysis | Library Project​ Hyderabad, Telangana | Aug 2023 – Dec 2023 ●​ Designed and implemented database tables for a library project. ●​ Applied constraints to ensure data integrity and consistency. ●​ Utilized advanced SQL functions, including group by, joins, and window functions. ●​ Effectively addressed complex queries and extracted meaningful insights for library analysis. Software Developer | Online Doctor Appointment System​ Hyderabad, Telangana | Mar 2022 – Jul 2022 ●​ Developed a comprehensive Online Doctor Appointment System using Python, Django, and MYSQL Database. ●​ Empowered users to consult doctors online and receive prescriptions, improving healthcare accessibility. ●​ Ensured seamless user experience through intuitive web design and functionality. ●​ Enhanced system security and data privacy measures. Tableau | Zomato Online Delivery​ Hyderabad, Telangana | Oct 2021 – Feb 2022 ●​ Utilized Tableau to develop interactive visualizations for Zomato online delivery data. ●​ Revealed valuable insights into customer preferences, geographical patterns, and delivery trends. ●​ Streamlined delivery operations and facilitated data-informed decision-making. Aurora’s PG College, Hyderabad, Telangana​ CGPA: 8.0​ Dec 2021 – Oct 2023​ ​ Bachelor of Science​ A.V Degree College, Hyderabad, Telangana​ CGPA: 8.92​ May 2018 – Aug 2021 ●​ Contributed to improving the efficiency of the delivery service. Certification ●​ Innomatics: Research Labs: Exploratory Data Analysis on Best Series ●​ Hacker Rank: SQL (Basic) ●​ Certified in MS Excel Extra-Curricular Achievements ●​ Volunteer of NSS (National Service Scheme) and actively participated in various social camps. .",
        "sections": {}
    },
    {
        "file_name": "sample_jd_2.pdf",
        "full_text": "Detailed Job Descriptions for Walk-In Drive 1. Data Science Interns • Internship Duration: 6 months, followed by permanent employment based on performance • Bond: 2.6 years, including the internship period (total 30 months from joining) • Role Overview: • Work on data engineering, data visualization, and data science tasks. • Build deep learning models using Generative AI, Computer Vision, and NLP. • Apply ML and deep learning algorithms effectively. • Work with data visualization tools like Tableau or Power BI. • Perform data processing using Pandas and Spark. • Possess strong analytical and problem-solving skills. • Eligibility Criteria: • Qualification: B.Tech, BE • Batch Eligibility: 2023 and earlier pass-outs • Job Types: Full-time, Internship, Fresher, Permanent • Stipend: ₹5,000 per month • Schedule: Day shift, Monday to Friday • Location: Pune (Onsite) 2. Data Engineer Intern • Location: Pune (Onsite) • Internship Duration: 6 months • Bond: 24 months post internship if converted to job • Requirements: • Formal training on Python & Spark • No prior experience required; 2022 or earlier graduates preferred • Job Responsibilities: • Build scalable streaming data pipelines • Write complex SQL queries to transform source data • Write stable, enterprise-grade code • Deploy data pipelines with DevOps team • Build automated job scheduling and monitoring scripts • Skills: • Exceptional programming skills in Python, Spark, Kafka, Pyspark, and C++ • Strong SQL and complex query writing skills • Knowledge of Pandas, Numpy, and Databricks (advantageous) • Familiarity with Exploratory Data Analysis and data pre-processing • Eligibility Criteria: • Qualification: B.Tech, BE • Batch Eligibility: 2023 and earlier pass-outs • Job Types: Full-time, Internship, Fresher, Permanent • Stipend: ₹5,000 per month • Schedule: Day shift, Monday to Friday",
        "sections": {
            "skills": "• Exceptional programming skills in Python, Spark, Kafka, Pyspark, and C++ • Strong SQL and complex query writing skills • Knowledge of Pandas, Numpy, and Databricks (advantageous) • Familiarity with Exploratory Data Analysis and data pre-processing • Eligibility Criteria: • Qualification: B.Tech, BE • Batch Eligibility: 2023 and earlier pass-outs • Job Types: Full-time, Internship, Fresher, Permanent • Stipend: ₹5,000 per month • Schedule: Day shift, Monday to Friday"
        }
    }
]